tutorials/Ti_Validation/2D_Ti_95_104/Allrun
#!/bin/sh

cp -r initial 0
blockMesh
setFields
laserbeamFoam
